```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_appautoscaling_policy.test_ecs_scale_down will be created
  + resource "aws_appautoscaling_policy" "test_ecs_scale_down" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "scale_down"
      + policy_type        = "StepScaling"
      + resource_id        = "service/your_cluster_name/service_name"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 600
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_upper_bound = "0"
              + scaling_adjustment          = -2
            }
        }
    }

  # aws_appautoscaling_policy.test_ecs_scale_up will be created
  + resource "aws_appautoscaling_policy" "test_ecs_scale_up" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "scale_up"
      + policy_type        = "StepScaling"
      + resource_id        = "service/your_cluster_name/service_name"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 600
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 2
            }
        }
    }

  # aws_appautoscaling_target.test_ecs_target will be created
  + resource "aws_appautoscaling_target" "test_ecs_target" {
      + id                 = (known after apply)
      + max_capacity       = 4
      + min_capacity       = 2
      + resource_id        = "service/your_cluster_name/service_name"
      + role_arn           = "arn:aws:iam::607754652120:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # aws_cloudwatch_metric_alarm.test_cpu_high will be created
  + resource "aws_cloudwatch_metric_alarm" "test_cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "cpu_utilization_high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "example"
          + "ServiceName" = "example"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Average"
      + threshold                             = 50
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.test_cpu_low will be created
  + resource "aws_cloudwatch_metric_alarm" "test_cpu_low" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "cpu_utilization_low"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "example"
          + "ServiceName" = "example"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Average"
      + threshold                             = 50
      + treat_missing_data                    = "missing"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

-
```